Revit 2027 API
ParameterTypeId.SpaceAssocRoomName Property
 "Room Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SpaceAssocRoomName { get; }
Public Shared ReadOnly Property SpaceAssocRoomName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SpaceAssocRoomName {
	ForgeTypeId^ get ();
}
static member SpaceAssocRoomName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace